WF/src/Catalogs/ВебСайт/ВебСайт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВебСайт</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ТипФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АлгоритмОбработки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеФайла</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеФайла</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Расширение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Системная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрольнаяСумма</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтносительнаяСсылка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтраницаАвторизации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтраницаДоступноБезАвторизации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Страница404</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтраницаОсновная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

WF/src/Catalogs/ВебСайт/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
			
	Если НЕ ЭтоГруппа Тогда
		
		Если ПроверитьСтраница404() или ПроверитьСтраницуАвторизации() или ПроверитьСтраницаОсновная() тогда
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		Расширение = Справочники.ВебСайт.РасширениеБезТочки(Справочники.ВебСайт.ПолучитьРасширениеИмениФайла(Наименование));
		
		Хеш = Новый ХешированиеДанных(ХешФункция.MD5);
		ДвоичныеДанные = ХранилищеФайла.Получить();
		Если ДвоичныеДанные <> Неопределено Тогда
			Хеш.Добавить(ДвоичныеДанные);
		КонецЕсли;
		Хеш.Добавить(АлгоритмОбработки);
		КонтрольнаяСумма = НРег(СтрЗаменить(Хеш.ХешСумма, " ", ""));
		ОтносительнаяСсылка = СформироватьОтносительнуюСсылку();
	КонецЕсли;
	
КонецПроцедуры

Функция СформироватьОтносительнуюСсылку() Экспорт
	
	Результат = "";
	Страница = ЭтотОбъект;
	
	Если ЗначениеЗаполнено(Наименование) Тогда
		
		Результат 		= Наименование;
		Пока ЗначениеЗаполнено(Страница.Родитель) Цикл			
			Страница 	= Страница.Родитель;
			Результат 	= Страница.Наименование + "/" + Результат;
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПроверитьСтраницуАвторизации()
	
	Если ЭтотОбъект.СтраницаАвторизации тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ВебСайт.Ссылка КАК Ссылка,
		|	ВебСайт.ОтносительнаяСсылка КАК ОтносительнаяСсылка
		|ИЗ
		|	Справочник.ВебСайт КАК ВебСайт
		|ГДЕ
		|	ВебСайт.СтраницаАвторизации
		|	И ВебСайт.Ссылка <> &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка",ЭтотОбъект.Ссылка);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() цикл		
			Сообщить(СтрШаблон("Страница %1 уже помеченна как страница авторизации.",Выборка.ОтносительнаяСсылка));
			Возврат Истина;			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция ПроверитьСтраница404()
	
	Если ЭтотОбъект.Страница404 тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ВебСайт.Ссылка КАК Ссылка,
		|	ВебСайт.ОтносительнаяСсылка КАК ОтносительнаяСсылка
		|ИЗ
		|	Справочник.ВебСайт КАК ВебСайт
		|ГДЕ
		|	ВебСайт.Страница404
		|	И ВебСайт.Ссылка <> &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка",ЭтотОбъект.Ссылка);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() цикл			
			Сообщить(СтрШаблон("Страница %1 уже помеченна как страница 404.",Выборка.ОтносительнаяСсылка));
			Возврат Истина;			
		КонецЦикла;
	
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция ПроверитьСтраницаОсновная()
	
	Если ЭтотОбъект.СтраницаОсновная тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ВебСайт.Ссылка КАК Ссылка,
		|	ВебСайт.ОтносительнаяСсылка КАК ОтносительнаяСсылка
		|ИЗ
		|	Справочник.ВебСайт КАК ВебСайт
		|ГДЕ
		|	ВебСайт.СтраницаОсновная
		|	И ВебСайт.Ссылка <> &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка",ЭтотОбъект.Ссылка);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() цикл			
			Сообщить(СтрШаблон("Страница %1 уже помеченна как основная страница.",Выборка.ОтносительнаяСсылка));
			Возврат Истина;			
		КонецЦикла;
	
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции


#КонецОбласти

#КонецЕсли
